<a href="https://colab.research.google.com/github/earandir/DataAnalysis/blob/main/Modulo03/Sesion08/M03S08R03merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Ejemplo 3: Uniendo `DataFrames` con `merge`

### 1. Objetivos:
- Tomar una base de datos segmentada y unirla usando el método `merge`    
 
### 2. Desarrollo:

#### a) Conformando un solo `DataFrame` a partir de la información de dos

Ya tenemos todos nuestros conjuntos de datos guardados cada uno en un archivo .csv. Cada uno contiene información que los demás no contienen, así que necesitamos una manera de unirlos para poder *complementar* con un conjunto la información que le hace falta a otro.

Vamos a leer nuestros dos archivos y crear un dataframe con cada uno `users` y `occupations`:

In [1]:
import pandas as pd

In [2]:
users = pd.read_csv('users.csv', index_col=0)

users.head()

        gender  age  occupation     cp
user_id
1            F    1          10  48067
2            M   56          16  70072
3            M   25          15  55117
4            M   45           7  02460
5            M   25          20  55455

In [3]:
occupations = pd.read_csv('occupations.csv', index_col=0)

occupations.head()

                          description
occupation_id
0              other or not specified
1                   academic/educator
2                              artist
3                      clerical/admin
4                college/grad student

`users` contiene una columna llamada `occupation` que tiene códigos que corresponden a un índice de la tabla `occupations`. Cada código está mapeado a una descripción textual de la ocupación.

Para "jalar" la información textual de las ocupaciones a la tabla `users` hacemos lo siguiente usamos la función `merge()` de la siguiente manera:

```
pd.merge(-dataframe izquierda-, -dataframe derecha-,
        left_on=-columna de la tabla izquierda a vincular-,
        right_index=True)
```
    
en este caso la columna de `users` es `occupation` y de `occupations` será la columna del índice:

In [4]:
pd.merge(users, occupations, left_on='occupation', right_index=True)

        gender  age  occupation     cp         description
user_id
1            F    1          10  48067        K-12 student
1            F    1          10  48067        K-12 student
1            F    1          10  48067        K-12 student
19           M    1          10  48073        K-12 student
19           M    1          10  48073        K-12 student
...        ...  ...         ...    ...                 ...
6026         M   35           6  11210  doctor/health care
6026         M   35           6  11210  doctor/health care
6040         M   25           6  11106  doctor/health care
6040         M   25           6  11106  doctor/health care
6040         M   25           6  11106  doctor/health care

[54360 rows x 5 columns]

Guardamos el resultado en la variable `users_full`:

In [5]:
users_full = pd.merge(users, occupations, left_on='occupation', right_index=True)

users_full.head()

        gender  age  occupation     cp   description
user_id
1            F    1          10  48067  K-12 student
1            F    1          10  48067  K-12 student
1            F    1          10  48067  K-12 student
19           M    1          10  48073  K-12 student
19           M    1          10  48073  K-12 student

También podríamos querer reordenar el índice con `df.reset_index()`:

In [6]:
users_full.reset_index(inplace=True)

users_full

       user_id gender  age  occupation     cp         description
0            1      F    1          10  48067        K-12 student
1            1      F    1          10  48067        K-12 student
2            1      F    1          10  48067        K-12 student
3           19      M    1          10  48073        K-12 student
4           19      M    1          10  48073        K-12 student
...        ...    ...  ...         ...    ...                 ...
54355     6026      M   35           6  11210  doctor/health care
54356     6026      M   35           6  11210  doctor/health care
54357     6040      M   25           6  11106  doctor/health care
54358     6040      M   25           6  11106  doctor/health care
54359     6040      M   25           6  11106  doctor/health care

[54360 rows x 6 columns]

Ahora podríamos cambiar los nombres de nuestras columnas para que sean más descriptivas usando el siguiente diccionario:

In [7]:
nuevas_columnas = {
    "occupation":"occupation_id",
    "description":"occupation"
}

Y la función `rename()` en la forma:

`df.rename(columns=-diccionario-)`

In [8]:
users_full.rename(columns=nuevas_columnas, inplace=True)

users_full.head(3)

   user_id gender  age  occupation_id     cp    occupation
0        1      F    1             10  48067  K-12 student
1        1      F    1             10  48067  K-12 student
2        1      F    1             10  48067  K-12 student

Listo. Ahora tenemos un `DataFrame` que incluye la información de ambos conjuntos de datos. Esto incrementa muchísimo nuestras posibilidades de análisis y visualización.

---
---

## Reto 3: `merge` para completar información faltante

### 1. Objetivos:
    - Completar la tabla `users` usando la información contenida en las tablas `occupations` y `age_ranges`.
    
### 2. Desarrollo:

#### a) Complementado información usando el método `merge`

No es muy práctico tener las tablas `occupations` y `age_range` por sí solas, ya que la información que contienen está íntimamente relacionada con al información de la tabla `users`. Vamos entonces a unir las tres tablas en una sola tabla para tener esa información mucho más accesible. Tu Reto consiste en los siguientes pasos:

1. Lee tus archivos `users`, `occupations` y `age_range` (o como sea que les quisiste llamar) y conviértelos en `DataFrames`.
2. Utiliza el método `merge` para agregar la información contenida en la tabla `occupations` a la tabla `users`.
3. Utiliza el método `merge` para agregar la información contenida en la tabla `age_ranges` a la tabla `users`.
4. Si lo consideras necesario, renombra y reordena las columnas para que la información sea clara.
5. Guarda tu nuevo conjunto de datos en un nuevo archivo .csv.

In [9]:
age_ranges = pd.read_csv('age_ranges.csv', index_col=0)

age_ranges.head()

       age_range
age_id
1       Under 18
18         18-24
25         25-34
35         35-44
45         45-49

In [10]:
users_full = pd.merge(users_full, age_ranges, left_on='age', right_index=True)

users_full.head()

   user_id gender  age  occupation_id     cp    occupation age_range
0        1      F    1             10  48067  K-12 student  Under 18
1        1      F    1             10  48067  K-12 student  Under 18
2        1      F    1             10  48067  K-12 student  Under 18
3       19      M    1             10  48073  K-12 student  Under 18
4       19      M    1             10  48073  K-12 student  Under 18

In [11]:
users_full.to_csv('users_full.csv')

Compara tus resultados con tus compañeros y tu ingeniero de datos de confianza para asegurarse de que todos tengan un conjunto similar o ¿no?